2021-2023/TNCO/Packages/rfs_databundle_ansible/Contains/databundle_ansible/Lifecycle/ansible/roles/resume/templates/bundle_resume.xml.j2

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<!-- suspend data service to subscriber -->
		<spml:modifyRequest timestamp="true" requestID="{{ extOrderId }}" xmlns:spml="urn:siemens:names:prov:gw:SPML:2:0" xmlns:sub="urn:siemens:names:prov:gw:SDL_MULTIAPPSUBSCRIBER:1:0">
			<version>SDL_MULTIAPPSUBSCRIBER_v10</version>
			<objectclass>Subscriber</objectclass>
			<identifier alias="imsi">{{ SUPI }}</identifier>
			{% if "DATA" in  listrequestedServices  %}
				<modification name="{{ hlr_path1 }}" operation="{{ operation2 }}">
					<valueObject xsi:type="sub:HLR">
						<odbgprs>{{ hlr_odbgprs1 }}</odbgprs>
					</valueObject>
				</modification>
				<modification name="{{ hlr_path3 }}" operation="{{ operation1 }}">
					<valueObject xsi:type="sub:PdnContextBlocking">
						<flagAPNBlockedOverS6a>{{ hlr1_flagAPNBlockedOverS6A }}</flagAPNBlockedOverS6a>
						<flagAPNBlockedOverSWx>{{ hlr1_flagAPNBlockedOverSWx }}</flagAPNBlockedOverSWx>
					</valueObject>
				</modification>
				<modification name="{{ hlr_path2 }}" operation="{{ operation2 }}">
					<valueObject xsi:type="sub:EPS">
						<defaultPdnContextId>{{ hlr1_defaultPdnContextId }}</defaultPdnContextId>
					</valueObject>
				</modification>
				<modification name="udm5gData/servingPlmnId/provisionedData/smfSelectionSubscriptionData/sNssaiInfo/dnnInfo[@dnnId='{{ dnn4 }}']/dnnBarred" operation="{{ operation4 }}"/>
				<modification name="udm5gData/servingPlmnId/provisionedData/smfSelectionSubscriptionData/sNssaiInfo/dnnInfo[@dnnId='{{ dnn4 }}']" operation="{{ operation2 }}">
					<valueObject xsi:type="sub:UdmDnnInfo">
						<defaultIndication>{{ dnn4_defaultIndication }}</defaultIndication>
					</valueObject>
				</modification>
				<modification name="udm5gData/servingPlmnId/provisionedData/smfSelectionSubscriptionData/sNssaiInfo/dnnInfo[@dnnId='{{ dnn5 }}']" operation="{{ operation2 }}">
					<valueObject xsi:type="sub:UdmDnnInfo">
						<defaultIndication>{{ dnn5_defaultIndication }}</defaultIndication>
					</valueObject>
				</modification>
			{% endif %}
		{% if "HOTSPOT" in  listrequestedServices  %}
			<modification name="{{ hlr_path4 }}" operation="{{ operation1 }}">
					<valueObject xsi:type="sub:PdnContextBlocking">
						<flagAPNBlockedOverS6a>{{ hlr1_flagAPNBlockedOverS6A }}</flagAPNBlockedOverS6a>
						<flagAPNBlockedOverSWx>{{ hlr1_flagAPNBlockedOverSWx }}</flagAPNBlockedOverSWx>
					</valueObject>
				</modification>
				<modification name="udm5gData/servingPlmnId/provisionedData/smfSelectionSubscriptionData/sNssaiInfo/dnnInfo[@dnnId='{{ dnn6 }}']/dnnBarred" operation="{{ operation4 }}"/>
		{% endif %}
		</spml:modifyRequest>
	</soapenv:Body>
</soapenv:Envelope>
